In [2]:
import pandas as pd 
import numpy as np

In [3]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20171101',periods=6))
s1

2017-11-01    1
2017-11-02    2
2017-11-03    3
2017-11-04    4
2017-11-05    5
2017-11-06    6
Freq: D, dtype: int64

In [5]:
df=pd.DataFrame(np.random.randn(6,4),index=pd.date_range('20171101',periods=6),
                columns=list('ABCD'))
df

                   A         B         C         D
2017-11-01 -0.505336  0.582141 -0.631240 -0.885237
2017-11-02  1.191640  0.609858  0.289464 -0.187028
2017-11-03 -0.930780 -1.204872 -1.454950 -0.102535
2017-11-04  2.088133 -0.063447 -1.491086 -0.162192
2017-11-05  2.140604  0.512777 -0.127335  0.243549
2017-11-06  0.712905  0.262634  0.322447 -0.173131

In [6]:
df['F']=s1#Setting a new column automatically aligns the data by the indexes
df

                   A         B         C         D  F
2017-11-01 -0.505336  0.582141 -0.631240 -0.885237  1
2017-11-02  1.191640  0.609858  0.289464 -0.187028  2
2017-11-03 -0.930780 -1.204872 -1.454950 -0.102535  3
2017-11-04  2.088133 -0.063447 -1.491086 -0.162192  4
2017-11-05  2.140604  0.512777 -0.127335  0.243549  5
2017-11-06  0.712905  0.262634  0.322447 -0.173131  6

In [8]:
df.at['20171101','A']=0#Setting values by label
df

                   A         B         C         D  F
2017-11-01  0.000000  0.582141 -0.631240 -0.885237  1
2017-11-02  1.191640  0.609858  0.289464 -0.187028  2
2017-11-03 -0.930780 -1.204872 -1.454950 -0.102535  3
2017-11-04  2.088133 -0.063447 -1.491086 -0.162192  4
2017-11-05  2.140604  0.512777 -0.127335  0.243549  5
2017-11-06  0.712905  0.262634  0.322447 -0.173131  6

In [9]:
df.iat[0,1]=0#Setting values by position
df

                   A         B         C         D  F
2017-11-01  0.000000  0.000000 -0.631240 -0.885237  1
2017-11-02  1.191640  0.609858  0.289464 -0.187028  2
2017-11-03 -0.930780 -1.204872 -1.454950 -0.102535  3
2017-11-04  2.088133 -0.063447 -1.491086 -0.162192  4
2017-11-05  2.140604  0.512777 -0.127335  0.243549  5
2017-11-06  0.712905  0.262634  0.322447 -0.173131  6

In [10]:
df.loc[:,'D']=np.array([5]*len(df))#Setting by assigning with a numpy array
df

                   A         B         C  D  F
2017-11-01  0.000000  0.000000 -0.631240  5  1
2017-11-02  1.191640  0.609858  0.289464  5  2
2017-11-03 -0.930780 -1.204872 -1.454950  5  3
2017-11-04  2.088133 -0.063447 -1.491086  5  4
2017-11-05  2.140604  0.512777 -0.127335  5  5
2017-11-06  0.712905  0.262634  0.322447  5  6

In [11]:
df2=df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D  F
2017-11-01  0.000000  0.000000 -0.631240 -5 -1
2017-11-02 -1.191640 -0.609858 -0.289464 -5 -2
2017-11-03 -0.930780 -1.204872 -1.454950 -5 -3
2017-11-04 -2.088133 -0.063447 -1.491086 -5 -4
2017-11-05 -2.140604 -0.512777 -0.127335 -5 -5
2017-11-06 -0.712905 -0.262634 -0.322447 -5 -6

In [12]:
dates=pd.date_range('20171101',periods=6)
dates

DatetimeIndex(['2017-11-01', '2017-11-02', '2017-11-03', '2017-11-04',
               '2017-11-05', '2017-11-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C  D  F    E
2017-11-01  0.000000  0.000000 -0.631240  5  1  1.0
2017-11-02  1.191640  0.609858  0.289464  5  2  1.0
2017-11-03 -0.930780 -1.204872 -1.454950  5  3  NaN
2017-11-04  2.088133 -0.063447 -1.491086  5  4  NaN

In [16]:
df1.dropna(how='any')#To drop any rows that have missing data

                  A         B         C  D  F    E
2017-11-01  0.00000  0.000000 -0.631240  5  1  1.0
2017-11-02  1.19164  0.609858  0.289464  5  2  1.0

In [17]:
df1.fillna(value=5)#Filling missing data

                   A         B         C  D  F    E
2017-11-01  0.000000  0.000000 -0.631240  5  1  1.0
2017-11-02  1.191640  0.609858  0.289464  5  2  1.0
2017-11-03 -0.930780 -1.204872 -1.454950  5  3  5.0
2017-11-04  2.088133 -0.063447 -1.491086  5  4  5.0

In [21]:
pd.isnull(df1)

                A      B      C      D      F      E
2017-11-01  False  False  False  False  False  False
2017-11-02  False  False  False  False  False  False
2017-11-03  False  False  False  False  False   True
2017-11-04  False  False  False  False  False   True

In [22]:
df.mean()

A    0.867084
B    0.019492
C   -0.515450
D    5.000000
F    3.500000
dtype: float64

In [23]:
df.mean(1)

2017-11-01    1.073752
2017-11-02    1.818192
2017-11-03    0.881880
2017-11-04    1.906720
2017-11-05    2.505209
2017-11-06    2.459597
Freq: D, dtype: float64

In [29]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)#后2个转换成nan,并变成前2个
s

2017-11-01    NaN
2017-11-02    NaN
2017-11-03    1.0
2017-11-04    3.0
2017-11-05    5.0
2017-11-06    NaN
Freq: D, dtype: float64

In [30]:
df.sub(s,axis='index')#按照对应索引减去s

                   A         B         C    D    F
2017-11-01       NaN       NaN       NaN  NaN  NaN
2017-11-02       NaN       NaN       NaN  NaN  NaN
2017-11-03 -1.930780 -2.204872 -2.454950  4.0  2.0
2017-11-04 -0.911867 -3.063447 -4.491086  2.0  1.0
2017-11-05 -2.859396 -4.487223 -5.127335  0.0  0.0
2017-11-06       NaN       NaN       NaN  NaN  NaN

In [31]:
df

                   A         B         C  D  F
2017-11-01  0.000000  0.000000 -0.631240  5  1
2017-11-02  1.191640  0.609858  0.289464  5  2
2017-11-03 -0.930780 -1.204872 -1.454950  5  3
2017-11-04  2.088133 -0.063447 -1.491086  5  4
2017-11-05  2.140604  0.512777 -0.127335  5  5
2017-11-06  0.712905  0.262634  0.322447  5  6

In [32]:
df.apply(np.cumsum)#按列累加

                   A         B         C   D   F
2017-11-01  0.000000  0.000000 -0.631240   5   1
2017-11-02  1.191640  0.609858 -0.341776  10   3
2017-11-03  0.260860 -0.595014 -1.796726  15   6
2017-11-04  2.348994 -0.658462 -3.287812  20  10
2017-11-05  4.489597 -0.145685 -3.415147  25  15
2017-11-06  5.202503  0.116950 -3.092700  30  21

In [33]:
df.apply(lambda x :x.max()-x.min())

A    3.071383
B    1.814730
C    1.813533
D    0.000000
F    5.000000
dtype: float64

In [37]:
s=pd.Series(np.random.randint(0,7,size=10))
s

0    2
1    3
2    0
3    5
4    6
5    0
6    5
7    2
8    3
9    0
dtype: int32

In [40]:
s.value_counts()
df['D'].value_counts()

5    6
Name: D, dtype: int64

In [39]:
s=pd.Series(['A','B','C','aVA','Bdc',np.nan,'CVSa'])
s.str.lower()

0       a
1       b
2       c
3     ava
4     bdc
5     NaN
6    cvsa
dtype: object

In [45]:
df5=pd.DataFrame(np.random.randn(5,4))
df5

          0         1         2         3
0  0.039592 -1.291680  0.532105 -0.363032
1  0.231189 -0.239313 -2.739314  0.263353
2 -0.077420 -1.291075 -0.501145  0.490389
3 -1.352728 -0.671201  0.286438 -1.157207
4 -0.274556  0.084971  0.164353  1.665489

In [46]:
pieces=[df5[:2],df5[2:4],df5[4:]]
pieces

[          0         1         2         3
 0  0.039592 -1.291680  0.532105 -0.363032
 1  0.231189 -0.239313 -2.739314  0.263353,
           0         1         2         3
 2 -0.077420 -1.291075 -0.501145  0.490389
 3 -1.352728 -0.671201  0.286438 -1.157207,
           0         1         2         3
 4 -0.274556  0.084971  0.164353  1.665489]

In [47]:
pd.concat(pieces)

          0         1         2         3
0  0.039592 -1.291680  0.532105 -0.363032
1  0.231189 -0.239313 -2.739314  0.263353
2 -0.077420 -1.291075 -0.501145  0.490389
3 -1.352728 -0.671201  0.286438 -1.157207
4 -0.274556  0.084971  0.164353  1.665489

In [48]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','foo'],'lval':[3,4]})
print(left)
print(right)

   key  lval
0  foo     1
1  foo     2
   key  lval
0  foo     3
1  foo     4

In [50]:
pd.merge(left,right,on='key')

   key  lval_x  lval_y
0  foo       1       3
1  foo       1       4
2  foo       2       3
3  foo       2       4

In [52]:
left=pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','bar'],'rval':[3,4]})
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     3
1  bar     2     4

In [53]:
df.to_excel('test.xls')#Writing to an excel file

In [56]:
r=pd.date_range('20171101',periods=10,freq='H')
r

DatetimeIndex(['2017-11-01 00:00:00', '2017-11-01 01:00:00',
               '2017-11-01 02:00:00', '2017-11-01 03:00:00',
               '2017-11-01 04:00:00', '2017-11-01 05:00:00',
               '2017-11-01 06:00:00', '2017-11-01 07:00:00',
               '2017-11-01 08:00:00', '2017-11-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')